1) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:42    [M] NotIdentical

--- Original
+++ New
@@ @@
     private ?LoggerInterface $logger;
     public function __construct(StrategiesLoader $strategiesLoader, ?LoggerInterface $logger = null)
     {
-        if ($logger !== null) {
+        if ($logger === null) {
             $this->logger = $logger;
         }
         $this->strategiesLoader = $strategiesLoader;

2) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:78    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         Entity::subscribe(function (Event $event) {
             $this->recordEvent($event);
         });
-        $iterations = 1;
+        $iterations = 0;
         while ($iterations <= $game->maxIterations()) {
             $this->logger()->debug(sprintf('Iteration #%s', $iterations));
             foreach ($strategies as $strategy) {

3) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         });
         $iterations = 1;
         while ($iterations <= $game->maxIterations()) {
-            $this->logger()->debug(sprintf('Iteration #%s', $iterations));
+            
             foreach ($strategies as $strategy) {
                 if ($strategy->execute($this->board)) {
                     $this->logger()->debug(sprintf('Strategy %s succeded', get_class($strategy)));

4) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:84    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger()->debug(sprintf('Iteration #%s', $iterations));
             foreach ($strategies as $strategy) {
                 if ($strategy->execute($this->board)) {
-                    $this->logger()->debug(sprintf('Strategy %s succeded', get_class($strategy)));
+                    
                     $status = $this->board->status();
                     if (!$status->isValid()) {
                         throw new ReachedInvalidStatus();

5) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:124    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                         break;
                 }
                 $message = sprintf("%s: add %s %s", $event->position(), $contentType, $event->content()->value());
-                $this->logger()->debug($message);
+                
                 if ($this->returnSteps) {
                     $this->events[] = $message;
                 }

6) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:136    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
                 break;
         }
     }
-    protected function logger() : LoggerInterface
+    private function logger() : LoggerInterface
     {
         if (isset($this->logger)) {
             return $this->logger;

7) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:132    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function content(int $row, int $col) : CellContent
     {
-        $this->checkRow($row);
+        
         $this->checkColumn($col);
         return $this->cells[$row][$col]->content();
     }

8) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:133    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function content(int $row, int $col) : CellContent
     {
         $this->checkRow($row);
-        $this->checkColumn($col);
+        
         return $this->cells[$row][$col]->content();
     }
     /**

9) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:214    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function isValid() : bool
     {
-        foreach ($this->rows() as $row) {
+        foreach (array() as $row) {
             if (!$row->isValid()) {
                 return false;
             }

10) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:220    [M] Foreach_

--- Original
+++ New
@@ @@
                 return false;
             }
         }
-        foreach ($this->columns() as $column) {
+        foreach (array() as $column) {
             if (!$column->isValid()) {
                 return false;
             }

13) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:249    [M] Foreach_

--- Original
+++ New
@@ @@
                 return false;
             }
         }
-        foreach ($this->squares() as $square) {
+        foreach (array() as $square) {
             if (!$square->isCompleted()) {
                 return false;
             }

14) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:262    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     private function initializeCells() : void
     {
         $this->cells = [];
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 0; $i <= 9; $i++) {
             $this->cells[$i] = [];
             for ($j = 1; $j <= 9; $j++) {
                 $this->cells[$i][$j] = new Cell(new Nothing());

15) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:307    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function initializeSquares() : void
     {
         $this->squares = [];
-        $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
+        $this->squares[1] = $this->createSquare(2, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);

16) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:307    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     private function initializeSquares() : void
     {
         $this->squares = [];
-        $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
+        $this->squares[0] = $this->createSquare(1, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);

17) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:307    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     private function initializeSquares() : void
     {
         $this->squares = [];
-        $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
+        $this->squares[1] = $this->createSquare(0, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);

18) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:308    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $this->squares = [];
         $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
-        $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
+        $this->squares[2] = $this->createSquare(3, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);

19) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:308    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $this->squares = [];
         $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
-        $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
+        $this->squares[2] = $this->createSquare(1, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);

20) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:309    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares = [];
         $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
-        $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
+        $this->squares[3] = $this->createSquare(2, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);

21) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:309    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares = [];
         $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
-        $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
+        $this->squares[3] = $this->createSquare(4, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);

22) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:311    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
-        $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
+        $this->squares[4] = $this->createSquare(3, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);

23) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:311    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[1] = $this->createSquare(1, 1, 3, 1, 3);
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
-        $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
+        $this->squares[4] = $this->createSquare(5, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);

24) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:312    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
-        $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
+        $this->squares[5] = $this->createSquare(4, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);

25) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:312    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[2] = $this->createSquare(2, 1, 3, 4, 6);
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
-        $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
+        $this->squares[5] = $this->createSquare(6, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);

26) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:313    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
-        $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
+        $this->squares[6] = $this->createSquare(5, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
         $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);

27) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:313    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[3] = $this->createSquare(3, 1, 3, 7, 9);
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
-        $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
+        $this->squares[6] = $this->createSquare(7, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
         $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);

28) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:315    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
-        $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
+        $this->squares[7] = $this->createSquare(6, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
         $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
     }

29) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:315    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[4] = $this->createSquare(4, 4, 6, 1, 3);
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
-        $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
+        $this->squares[7] = $this->createSquare(8, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
         $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
     }

30) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:316    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
-        $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
+        $this->squares[8] = $this->createSquare(7, 7, 9, 4, 6);
         $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
     }
     private function createSquare(int $squareNumber, int $fromRow, int $toRow, int $fromColumn, int $toColumn) : Square

31) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:316    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[5] = $this->createSquare(5, 4, 6, 4, 6);
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
-        $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
+        $this->squares[8] = $this->createSquare(9, 7, 9, 4, 6);
         $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
     }
     private function createSquare(int $squareNumber, int $fromRow, int $toRow, int $fromColumn, int $toColumn) : Square

32) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:317    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
-        $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
+        $this->squares[10] = $this->createSquare(9, 7, 9, 7, 9);
     }
     private function createSquare(int $squareNumber, int $fromRow, int $toRow, int $fromColumn, int $toColumn) : Square
     {

33) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:317    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
-        $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
+        $this->squares[9] = $this->createSquare(8, 7, 9, 7, 9);
     }
     private function createSquare(int $squareNumber, int $fromRow, int $toRow, int $fromColumn, int $toColumn) : Square
     {

34) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:317    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->squares[6] = $this->createSquare(6, 4, 6, 7, 9);
         $this->squares[7] = $this->createSquare(7, 7, 9, 1, 3);
         $this->squares[8] = $this->createSquare(8, 7, 9, 4, 6);
-        $this->squares[9] = $this->createSquare(9, 7, 9, 7, 9);
+        $this->squares[9] = $this->createSquare(10, 7, 9, 7, 9);
     }
     private function createSquare(int $squareNumber, int $fromRow, int $toRow, int $fromColumn, int $toColumn) : Square
     {

35) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Cell.php:80    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($this->value()) {
             $this->tips = [];
         }
-        $this->publish(new SetContent($this->position(), $content));
+        
     }
     public function content() : CellContent
     {

36) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Cell.php:113    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function setTied(int ...$ties)
     {
-        $this->checkTipIsAllowed();
+        
         $this->setContent(new Tied(...$ties));
         $this->clearTips();
         foreach ($ties as $tie) {

37) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Cell.php:116    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $this->checkTipIsAllowed();
         $this->setContent(new Tied(...$ties));
-        $this->clearTips();
+        
         foreach ($ties as $tie) {
             $this->addTip($tie);
         }

38) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Cell.php:124    [M] InstanceOf_

--- Original
+++ New
@@ @@
     }
     public function isTied() : bool
     {
-        return $this->content instanceof Tied;
+        return false;
     }
     public function ties() : array
     {

39) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Cell.php:151    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->checkTipIsAllowed();
         $this->tips[] = $digit;
         sort($this->tips);
-        $this->publish(new AddTip($this->position(), $digit));
+        
     }
     /**
      * @param int|null $digit

41) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Cell.php:177    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
         }
         $this->tips = $tips;
-        $this->publish(new ClearTips($this->position(), $digit));
+        
     }
     /**
      * @param int $digit

44) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Entity.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 abstract class Entity
 {
     private static ?EventBus $eventBus;
-    public static function eventBus() : EventBus
+    protected static function eventBus() : EventBus
     {
         if (!isset(self::$eventBus)) {
             self::$eventBus = new EventBus();

45) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Entity.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function publish(Event $event) : void
     {
-        self::eventBus()->publish($event);
+        
     }
     public static function subscribe(callable $subscriptor) : void
     {

46) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Entity.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public static function subscribe(callable $subscriptor) : void
     {
-        self::eventBus()->subscribe($subscriptor);
+        
     }
 }

47) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/OneDimensionMatrix.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $this->number = $number;
         $this->cells = [];
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 2; $i <= 9; $i++) {
             $this->cells[$i] = null;
         }
     }

48) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/OneDimensionMatrix.php:23    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     {
         $this->number = $number;
         $this->cells = [];
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 1; $i < 9; $i++) {
             $this->cells[$i] = null;
         }
     }

49) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/OneDimensionMatrix.php:23    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     {
         $this->number = $number;
         $this->cells = [];
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 1; $i > 9; $i++) {
             $this->cells[$i] = null;
         }
     }

50) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/OneDimensionMatrix.php:23    [M] For_

--- Original
+++ New
@@ @@
     {
         $this->number = $number;
         $this->cells = [];
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 1; false; $i++) {
             $this->cells[$i] = null;
         }
     }

51) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/OneDimensionMatrix.php:61    [M] TrueValue

--- Original
+++ New
@@ @@
                 if (isset($values[$content->value()])) {
                     return false;
                 }
-                $values[$content->value()] = true;
+                $values[$content->value()] = false;
             }
         }
         return true;

53) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

54) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [2 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

55) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

56) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:24    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [2 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

57) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:24    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 1 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

58) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:24    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 2 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

59) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:24    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 3 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

60) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 1 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

61) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

62) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

63) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:27    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [2 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

64) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:27    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 1 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

65) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:27    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 2 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

66) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:27    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 3 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {
