67) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:29    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

68) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:29    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [2 => null, 3 => null]];
     }
     public function number() : int
     {

69) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [2 => null, 2 => null, 3 => null]];
     }
     public function number() : int
     {

70) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:30    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 1 => null, 3 => null]];
     }
     public function number() : int
     {

71) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 3 => null, 3 => null]];
     }
     public function number() : int
     {

72) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:30    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(int $number)
     {
         $this->number = $number;
-        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 3 => null]];
+        $this->cells = [1 => [1 => null, 2 => null, 3 => null], 2 => [1 => null, 2 => null, 3 => null], 3 => [1 => null, 2 => null, 2 => null]];
     }
     public function number() : int
     {

73) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Square.php:92    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     {
         $missingValues = [];
         $values = $this->values();
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 1; $i < 9; $i++) {
             if (!isset($values[$i])) {
                 $missingValues[] = $i;
             }

76) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Exception/InvalidColumnValue.php:13    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $column)
     {
         $this->column = $column;
-        parent::__construct();
+        
     }
 }

78) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Exception/InvalidRowValue.php:13    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $row)
     {
         $this->row = $row;
-        parent::__construct();
+        
     }
 }

79) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Exception/InvalidValue.php:13    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct(int $value)
     {
         $this->value = $value;
-        parent::__construct();
+        
     }
 }

80) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillDigitsInSquares.php:30    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         foreach ($board->squares() as $square) {
             if ($this->fillDigitsInSquare($square)) {
-                return true;
+                return false;
             }
         }
         return false;

81) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastCellInColumns.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @return bool
      * @throws InvalidPosition
      */
-    public function fillLastCellInColumn(Column $column) : bool
+    protected function fillLastCellInColumn(Column $column) : bool
     {
         return $this->fillLastCellInSet($column);
     }
 }

82) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastCellInSquares.php:37    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     private function fillLastCellInSquare(Square $square) : bool
     {
         $missingValues = $square->missingValues();
-        for ($i = 1; $i <= 3; $i++) {
+        for ($i = 1; $i < 3; $i++) {
             for ($j = 1; $j <= 3; $j++) {
                 if ($square->content($i, $j)->value() === null) {
                     $square->setFound($i, $j, $missingValues[0]);

83) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:23    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      */
     public function execute(Board $board) : bool
     {
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 0; $i <= 9; $i++) {
             if ($board->countDigit($i) == 8) {
                 return $this->fillLastDigit($board, $i);
             }

84) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:23    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
      */
     public function execute(Board $board) : bool
     {
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 1; $i < 9; $i++) {
             if ($board->countDigit($i) == 8) {
                 return $this->fillLastDigit($board, $i);
             }

85) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:48    [M] Break_

--- Original
+++ New
@@ @@
         foreach ($board->rows() as $row) {
             if ($row->findDigit($digit) === null) {
                 $rowNumber = $row->number();
-                break;
+                continue;
             }
         }
         foreach ($board->columns() as $column) {

86) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:58    [M] LogicalOr

--- Original
+++ New
@@ @@
                 $colNumber = $column->number();
             }
         }
-        if ($rowNumber === null || $colNumber === null) {
+        if ($rowNumber === null && $colNumber === null) {
             return false;
         }
         $board->setFound($rowNumber, $colNumber, $digit);

87) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FindCellsTiedByTips.php:27    [M] Foreach_

--- Original
+++ New
@@ @@
      */
     public function execute(Board $board) : bool
     {
-        foreach ($board->squares() as $square) {
+        foreach (array() as $square) {
             if ($this->findCellsTiedByTipsInSquare->execute($square)) {
                 return true;
             }

89) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FillDigitInSquare.php:50    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             $possibleCells[0]->setContent(new Found($digit));
             return true;
         }
-        if (count($possibleCells) >= 2) {
+        if (count($possibleCells) > 2) {
             /** @var Cell $cell */
             foreach ($possibleCells as $cell) {
                 $cell->addTip($digit);

90) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:21    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         foreach ($square->cellsAsSingleArray() as $cell) {
             if ($cell->value() !== null) {
-                return false;
+                return true;
             }
             $tips = $cell->tips();
             $position = $cell->position();

91) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:27    [M] LessThan

--- Original
+++ New
@@ @@
             }
             $tips = $cell->tips();
             $position = $cell->position();
-            if (count($tips) < 2) {
+            if (count($tips) <= 2) {
                 return false;
             }
             foreach ($square->cellsAsSingleArray() as $otherCell) {

92) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:28    [M] FalseValue

--- Original
+++ New
@@ @@
             $tips = $cell->tips();
             $position = $cell->position();
             if (count($tips) < 2) {
-                return false;
+                return true;
             }
             foreach ($square->cellsAsSingleArray() as $otherCell) {
                 if ($otherCell->position() === $position) {

93) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:37    [M] Continue_

--- Original
+++ New
@@ @@
                     continue;
                 }
                 if ($otherCell->value() !== null) {
-                    continue;
+                    break;
                 }
                 if (count($otherCell->tips()) < 2) {
                     continue;

94) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:40    [M] LessThan

--- Original
+++ New
@@ @@
                 if ($otherCell->value() !== null) {
                     continue;
                 }
-                if (count($otherCell->tips()) < 2) {
+                if (count($otherCell->tips()) <= 2) {
                     continue;
                 }
                 $tipsMatches = $this->findTipsMatches($tips, $otherCell->tips());

95) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:41    [M] Continue_

--- Original
+++ New
@@ @@
                     continue;
                 }
                 if (count($otherCell->tips()) < 2) {
-                    continue;
+                    break;
                 }
                 $tipsMatches = $this->findTipsMatches($tips, $otherCell->tips());
                 if (count($tipsMatches) == 0) {

96) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:46    [M] Continue_

--- Original
+++ New
@@ @@
                 }
                 $tipsMatches = $this->findTipsMatches($tips, $otherCell->tips());
                 if (count($tipsMatches) == 0) {
-                    continue;
+                    break;
                 }
                 foreach ($tipsMatches as $tipsMatch) {
                     if ($this->isValidTipMatchForSquare($tipsMatch, $square, [$position, $otherCell->position()])) {

97) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:64    [M] UnwrapArrayIntersect

--- Original
+++ New
@@ @@
     }
     private function findTipsMatches(array $tipsA, array $tipsB) : array
     {
-        $matches = array_intersect($tipsA, $tipsB);
+        $matches = $tipsB;
         if (count($matches) < 2) {
             return [];
         }

98) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:70    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (count($matches) < 2) {
             return [];
         }
-        if (count($matches) == 2) {
+        if (count($matches) == 1) {
             return [$matches];
         }
         $matches = array_values($matches);

99) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:70    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (count($matches) < 2) {
             return [];
         }
-        if (count($matches) == 2) {
+        if (count($matches) == 3) {
             return [$matches];
         }
         $matches = array_values($matches);

100) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:70    [M] Equal

--- Original
+++ New
@@ @@
         if (count($matches) < 2) {
             return [];
         }
-        if (count($matches) == 2) {
+        if (count($matches) != 2) {
             return [$matches];
         }
         $matches = array_values($matches);

101) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:74    [M] UnwrapArrayValues

--- Original
+++ New
@@ @@
         if (count($matches) == 2) {
             return [$matches];
         }
-        $matches = array_values($matches);
+        $matches = $matches;
         $tipMatches = [];
         for ($i = 0; $i < count($matches); $i++) {
             for ($j = $i + 1; $j < count($matches); $j++) {

102) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:78    [M] For_

--- Original
+++ New
@@ @@
         }
         $matches = array_values($matches);
         $tipMatches = [];
-        for ($i = 0; $i < count($matches); $i++) {
+        for ($i = 0; false; $i++) {
             for ($j = $i + 1; $j < count($matches); $j++) {
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }

103) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:78    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }
         $matches = array_values($matches);
         $tipMatches = [];
-        for ($i = 0; $i < count($matches); $i++) {
+        for ($i = 1; $i < count($matches); $i++) {
             for ($j = $i + 1; $j < count($matches); $j++) {
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }

104) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:78    [M] LessThan

--- Original
+++ New
@@ @@
         }
         $matches = array_values($matches);
         $tipMatches = [];
-        for ($i = 0; $i < count($matches); $i++) {
+        for ($i = 0; $i <= count($matches); $i++) {
             for ($j = $i + 1; $j < count($matches); $j++) {
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }

105) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:78    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
         }
         $matches = array_values($matches);
         $tipMatches = [];
-        for ($i = 0; $i < count($matches); $i++) {
+        for ($i = 0; $i >= count($matches); $i++) {
             for ($j = $i + 1; $j < count($matches); $j++) {
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }

106) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:79    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $matches = array_values($matches);
         $tipMatches = [];
         for ($i = 0; $i < count($matches); $i++) {
-            for ($j = $i + 1; $j < count($matches); $j++) {
+            for ($j = $i + 2; $j < count($matches); $j++) {
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }
         }

107) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:79    [M] For_

--- Original
+++ New
@@ @@
         $matches = array_values($matches);
         $tipMatches = [];
         for ($i = 0; $i < count($matches); $i++) {
-            for ($j = $i + 1; $j < count($matches); $j++) {
+            for ($j = $i + 1; false; $j++) {
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }
         }

108) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:84    [M] ArrayOneItem

--- Original
+++ New
@@ @@
                 $tipMatches[] = [$matches[$i], $matches[$j]];
             }
         }
-        return $tipMatches;
+        return count($tipMatches) > 1 ? array_slice($tipMatches, 0, 1, true) : $tipMatches;
     }
     /**
      * @param array $tips

109) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:106    [M] UnwrapArrayIntersect

--- Original
+++ New
@@ @@
             if ($cell->value() !== null) {
                 continue;
             }
-            if (count(array_intersect($tips, $cell->tips())) !== 0) {
+            if (count($cell->tips()) !== 0) {
                 return false;
             }
         }

110) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @return bool
      * @throws InvalidPosition
      */
-    public function execute(int $digit, $oneDimensionMatrix) : bool
+    protected function execute(int $digit, $oneDimensionMatrix) : bool
     {
         $cells = $oneDimensionMatrix->cells();
         return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);

111) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function execute(int $digit, $oneDimensionMatrix) : bool
     {
         $cells = $oneDimensionMatrix->cells();
-        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);
+        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[3], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);
     }
     /**
      * @param int $digit

112) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function execute(int $digit, $oneDimensionMatrix) : bool
     {
         $cells = $oneDimensionMatrix->cells();
-        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);
+        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[5], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);
     }
     /**
      * @param int $digit

113) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:24    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function execute(int $digit, $oneDimensionMatrix) : bool
     {
         $cells = $oneDimensionMatrix->cells();
-        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);
+        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[6], $cells[8], $cells[9]);
     }
     /**
      * @param int $digit

114) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:24    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function execute(int $digit, $oneDimensionMatrix) : bool
     {
         $cells = $oneDimensionMatrix->cells();
-        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[7], $cells[8], $cells[9]);
+        return $this->findDigitTipInCells($digit, $cells[1], $cells[2], $cells[3]) || $this->findDigitTipInCells($digit, $cells[4], $cells[5], $cells[6]) || $this->findDigitTipInCells($digit, $cells[8], $cells[8], $cells[9]);
     }
     /**
      * @param int $digit

115) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @return bool
      * @throws InvalidPosition
      */
-    public function findDigitTipInCells(int $digit, Cell ...$cells) : bool
+    protected function findDigitTipInCells(int $digit, Cell ...$cells) : bool
     {
         $count = 0;
         $positions = [];

116) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitTipInOneDimensionMatrix.php:50    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         if ($count < 2) {
             return false;
         }
-        foreach ($cells[0]->square()->cellsAsSingleArray() as $cell) {
+        foreach ($cells[1]->square()->cellsAsSingleArray() as $cell) {
             try {
                 if ($cell->findTip($digit)) {
                     if (!in_array($cell->position(), $positions)) {

117) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitValidInCell.php:30    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (!$cell->isEmpty()) {
             return false;
         }
-        if ($cell->isTied() and !array_search($digit, $cell->ties())) {
+        if ($cell->isTied() and array_search($digit, $cell->ties())) {
             return false;
         }
         if ($cell->row()->findDigit($digit) !== null) {

118) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/ValueObject/Result.php:47    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function toArray()
     {
         $array = [];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 0; $row <= 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if ($this->cell($row, $column) !== null) {
                     if (!isset($array[$row])) {

119) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/ValueObject/Result.php:48    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
         $array = [];
         for ($row = 1; $row <= 9; $row++) {
-            for ($column = 1; $column <= 9; $column++) {
+            for ($column = 0; $column <= 9; $column++) {
                 if ($this->cell($row, $column) !== null) {
                     if (!isset($array[$row])) {
                         $array[$row] = [];

120) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:43    [M] Coalesce

--- Original
+++ New
@@ @@
     {
         $this->loggerFactory = $loggerFactory ?? new ConsoleLoggerFactory();
         $this->sudokuFileReader = $sudokuFileReader ?? new SudokuFileReader();
-        $this->resultFormatter = $resultFormatter ?? new SudokuResultFormatter();
+        $this->resultFormatter = new SudokuResultFormatter();
         $this->resultPrinter = $resultPrinter ?? new SudokuResultPrinter();
         parent::__construct($name);
     }

121) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:44    [M] Coalesce

--- Original
+++ New
@@ @@
         $this->loggerFactory = $loggerFactory ?? new ConsoleLoggerFactory();
         $this->sudokuFileReader = $sudokuFileReader ?? new SudokuFileReader();
         $this->resultFormatter = $resultFormatter ?? new SudokuResultFormatter();
-        $this->resultPrinter = $resultPrinter ?? new SudokuResultPrinter();
+        $this->resultPrinter = new SudokuResultPrinter();
         parent::__construct($name);
     }
     protected function configure()

123) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $this->logger = $this->loggerFactory->getLogger($output);
-            $this->logger->info('Sudoku started');
+            
             $data = $this->sudokuFileReader->read($input->getArgument('file'));
             $returnSteps = (bool) $input->getOption('return_steps');
             $maxIterations = (int) $input->getOption('max_iterations');

124) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:80    [M] CastBool

--- Original
+++ New
@@ @@
             $this->logger = $this->loggerFactory->getLogger($output);
             $this->logger->info('Sudoku started');
             $data = $this->sudokuFileReader->read($input->getArgument('file'));
-            $returnSteps = (bool) $input->getOption('return_steps');
+            $returnSteps = $input->getOption('return_steps');
             $maxIterations = (int) $input->getOption('max_iterations');
             $payload = new SolveSudokuPayload($data, $maxIterations, $returnSteps);
             $handler = new SolveSudokuHandler(new StrategiesLoaderHardcoded(), $this->logger);

125) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:81    [M] CastInt

--- Original
+++ New
@@ @@
             $this->logger->info('Sudoku started');
             $data = $this->sudokuFileReader->read($input->getArgument('file'));
             $returnSteps = (bool) $input->getOption('return_steps');
-            $maxIterations = (int) $input->getOption('max_iterations');
+            $maxIterations = $input->getOption('max_iterations');
             $payload = new SolveSudokuPayload($data, $maxIterations, $returnSteps);
             $handler = new SolveSudokuHandler(new StrategiesLoaderHardcoded(), $this->logger);
             $result = $handler->execute($payload);

126) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:86    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $payload = new SolveSudokuPayload($data, $maxIterations, $returnSteps);
             $handler = new SolveSudokuHandler(new StrategiesLoaderHardcoded(), $this->logger);
             $result = $handler->execute($payload);
-            $this->resultPrinter->print($output, $this->resultFormatter->format($result, $returnSteps));
+            
         } catch (NotPossibleToSolve $exception) {
             $this->logger->error('Not possible to solve sudoku');
             return -1;

127) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Domain/Sudoku/Strategy/StrategiesLoaderHardcoded.php:19    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     /** @inheritDoc */
     public function load() : array
     {
-        return [new FillLastCellInBoard(), new FillLastCellInRows(), new FillLastCellInColumns(), new FillLastCellInSquares(), new FillLastDigitInBoard(), new FindCellsTiedByTips(), new FillDigitsInSquares()];
+        return [new FillLastCellInRows(), new FillLastCellInColumns(), new FillLastCellInSquares(), new FillLastDigitInBoard(), new FindCellsTiedByTips(), new FillDigitsInSquares()];
     }
 }

128) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuFileReader.php:50    [M] Throw_

--- Original
+++ New
@@ @@
     private function parseJson(array $jsonData) : array
     {
         if (!isset($jsonData['board'])) {
-            throw new IncorrectFormat('tag board not found');
+            new IncorrectFormat('tag board not found');
         }
         if (!isset($jsonData['board']['fixedCells'])) {
             throw new IncorrectFormat('tag board::fixedCells not found');

129) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuFileReader.php:69    [M] LogicalNot

--- Original
+++ New
@@ @@
             if (!isset($cell['value'])) {
                 throw new IncorrectFormat('cell without tag value found');
             }
-            if (!isset($data[$cell['row']])) {
+            if (isset($data[$cell['row']])) {
                 $data[$cell['row']] = [];
             }
             $data[$cell['row']][$cell['column']] = $cell['value'];

131) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:11    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function format(Result $result, bool $includeSteps) : string
     {
-        $formatedResult = ['board' => []];
+        $formatedResult = [];
         for ($row = 1; $row <= 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
