132) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:15    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     public function format(Result $result, bool $includeSteps) : string
     {
         $formatedResult = ['board' => []];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 1; $row > 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];

133) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:15    [M] For_

--- Original
+++ New
@@ @@
     public function format(Result $result, bool $includeSteps) : string
     {
         $formatedResult = ['board' => []];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 1; false; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];

134) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:15    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function format(Result $result, bool $includeSteps) : string
     {
         $formatedResult = ['board' => []];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 2; $row <= 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];

135) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:15    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function format(Result $result, bool $includeSteps) : string
     {
         $formatedResult = ['board' => []];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 0; $row <= 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];

136) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:15    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     public function format(Result $result, bool $includeSteps) : string
     {
         $formatedResult = ['board' => []];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 1; $row < 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];

137) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:16    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $formatedResult = ['board' => []];
         for ($row = 1; $row <= 9; $row++) {
-            for ($column = 1; $column <= 9; $column++) {
+            for ($column = 2; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];
                 }

139) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:16    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     {
         $formatedResult = ['board' => []];
         for ($row = 1; $row <= 9; $row++) {
-            for ($column = 1; $column <= 9; $column++) {
+            for ($column = 1; $column < 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];
                 }

140) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:16    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     {
         $formatedResult = ['board' => []];
         for ($row = 1; $row <= 9; $row++) {
-            for ($column = 1; $column <= 9; $column++) {
+            for ($column = 1; $column > 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];
                 }

141) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:16    [M] For_

--- Original
+++ New
@@ @@
     {
         $formatedResult = ['board' => []];
         for ($row = 1; $row <= 9; $row++) {
-            for ($column = 1; $column <= 9; $column++) {
+            for ($column = 1; false; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];
                 }

142) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:17    [M] NotIdentical

--- Original
+++ New
@@ @@
         $formatedResult = ['board' => []];
         for ($row = 1; $row <= 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
-                if (($value = $result->cell($row, $column)) !== null) {
+                if (($value = $result->cell($row, $column)) === null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];
                 }
             }

143) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:18    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         for ($row = 1; $row <= 9; $row++) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
-                    $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];
+                    $formatedResult['board'][] = ['column' => $column, 'value' => $value];
                 }
             }
         }

144) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultPrinter.php:11    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
 {
     public function print(OutputInterface $output, string $result) : void
     {
-        $output->writeln($result);
+        
     }
 }


Timed Out mutants:
==================

1) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:96    [M] Increment

--- Original
+++ New
@@ @@
                     continue;
                 }
             }
-            $iterations++;
+            $iterations--;
         }
         throw new NotPossibleToSolve();
     }

2) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:112    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->checkRow($row);
         $this->checkColumn($col);
         $this->checkValue($value);
-        $this->cells[$row][$col]->setContent(new Found($value));
+        
     }
     /**
      * @return Cell[][]

3) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/OneDimensionMatrix.php:128    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function setFound(int $index, int $value) : void
     {
-        $this->cells[$index]->setContent(new Found($value));
+        
     }
     public function findDigit(int $digit) : ?int
     {

7) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastCellInSquares.php:39    [M] Identical

--- Original
+++ New
@@ @@
         $missingValues = $square->missingValues();
         for ($i = 1; $i <= 3; $i++) {
             for ($j = 1; $j <= 3; $j++) {
-                if ($square->content($i, $j)->value() === null) {
+                if ($square->content($i, $j)->value() !== null) {
                     $square->setFound($i, $j, $missingValues[0]);
                     return true;
                 }

8) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastCellInSquares.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         for ($i = 1; $i <= 3; $i++) {
             for ($j = 1; $j <= 3; $j++) {
                 if ($square->content($i, $j)->value() === null) {
-                    $square->setFound($i, $j, $missingValues[0]);
+                    
                     return true;
                 }
             }

9) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:23    [M] Increment

--- Original
+++ New
@@ @@
      */
     public function execute(Board $board) : bool
     {
-        for ($i = 1; $i <= 9; $i++) {
+        for ($i = 1; $i <= 9; $i--) {
             if ($board->countDigit($i) == 8) {
                 return $this->fillLastDigit($board, $i);
             }

11) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:62    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($rowNumber === null || $colNumber === null) {
             return false;
         }
-        $board->setFound($rowNumber, $colNumber, $digit);
+        
         return true;
     }
 }

12) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Strategy.php:65    [M] Identical

--- Original
+++ New
@@ @@
     {
         $missingValues = $set->missingValues();
         for ($i = 1; $i <= 9; $i++) {
-            if ($set->content($i)->value() === null) {
+            if ($set->content($i)->value() !== null) {
                 $set->setFound($i, $missingValues[0]);
                 return true;
             }

13) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Strategy.php:66    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $missingValues = $set->missingValues();
         for ($i = 1; $i <= 9; $i++) {
             if ($set->content($i)->value() === null) {
-                $set->setFound($i, $missingValues[0]);
+                
                 return true;
             }
         }

14) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/ValueObject/Result.php:47    [M] Increment

--- Original
+++ New
@@ @@
     public function toArray()
     {
         $array = [];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 1; $row <= 9; $row--) {
             for ($column = 1; $column <= 9; $column++) {
                 if ($this->cell($row, $column) !== null) {
                     if (!isset($array[$row])) {

15) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/ValueObject/Result.php:48    [M] Increment

--- Original
+++ New
@@ @@
     {
         $array = [];
         for ($row = 1; $row <= 9; $row++) {
-            for ($column = 1; $column <= 9; $column++) {
+            for ($column = 1; $column <= 9; $column--) {
                 if ($this->cell($row, $column) !== null) {
                     if (!isset($array[$row])) {
                         $array[$row] = [];

16) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuResultFormatter.php:15    [M] Increment

--- Original
+++ New
@@ @@
     public function format(Result $result, bool $includeSteps) : string
     {
         $formatedResult = ['board' => []];
-        for ($row = 1; $row <= 9; $row++) {
+        for ($row = 1; $row <= 9; $row--) {
             for ($column = 1; $column <= 9; $column++) {
                 if (($value = $result->cell($row, $column)) !== null) {
                     $formatedResult['board'][] = ['row' => $row, 'column' => $column, 'value' => $value];

1) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:76    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $strategies = $this->strategiesLoader->load();
         $this->returnSteps = $game->returnSteps();
-        Entity::subscribe(function (Event $event) {
-            $this->recordEvent($event);
-        });
+        
         $iterations = 1;
         while ($iterations <= $game->maxIterations()) {
             $this->logger()->debug(sprintf('Iteration #%s', $iterations));

2) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:76    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $strategies = $this->strategiesLoader->load();
         $this->returnSteps = $game->returnSteps();
         Entity::subscribe(function (Event $event) {
-            $this->recordEvent($event);
+            
         });
         $iterations = 1;
         while ($iterations <= $game->maxIterations()) {

3) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Application/Handler/SolveSudoku.php:87    [M] Throw_

--- Original
+++ New
@@ @@
                     $this->logger()->debug(sprintf('Strategy %s succeded', get_class($strategy)));
                     $status = $this->board->status();
                     if (!$status->isValid()) {
-                        throw new ReachedInvalidStatus();
+                        new ReachedInvalidStatus();
                     }
                     if ($status->isCompleted()) {
                         return new Result($this->board, $this->events);

4) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:145    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @throws InvalidColumnValue
      * @throws InvalidRowValue
      */
-    public function value(int $row, int $col) : ?int
+    protected function value(int $row, int $col) : ?int
     {
         $this->checkRow($row);
         $this->checkColumn($col);

7) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:245    [M] FalseValue

--- Original
+++ New
@@ @@
         }
         foreach ($this->columns() as $column) {
             if (!$column->isCompleted()) {
-                return false;
+                return true;
             }
         }
         foreach ($this->squares() as $square) {

8) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Entity/Board.php:251    [M] FalseValue

--- Original
+++ New
@@ @@
         }
         foreach ($this->squares() as $square) {
             if (!$square->isCompleted()) {
-                return false;
+                return true;
             }
         }
         return true;

11) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FillLastDigitInBoard.php:59    [M] FalseValue

--- Original
+++ New
@@ @@
             }
         }
         if ($rowNumber === null || $colNumber === null) {
-            return false;
+            return true;
         }
         $board->setFound($rowNumber, $colNumber, $digit);
         return true;
     }
 }

12) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/FindCellsTiedByTips.php:29    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         foreach ($board->squares() as $square) {
             if ($this->findCellsTiedByTipsInSquare->execute($square)) {
-                return true;
+                return false;
             }
         }
         return false;
     }
 }

13) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Strategy.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use App\Domain\Sudoku\Entity\Row;
 abstract class Strategy extends Entity implements \App\Domain\Sudoku\Strategy\Strategy
 {
-    public function countExistingValues(array $values) : int
+    protected function countExistingValues(array $values) : int
     {
         return count(array_filter($values, function ($position) {
             return !is_null($position);

14) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Strategy.php:17    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function countExistingValues(array $values) : int
     {
         return count(array_filter($values, function ($position) {
-            return !is_null($position);
+            return is_null($position);
         }));
     }
     /**

15) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Strategy.php:17    [M] UnwrapArrayFilter

--- Original
+++ New
@@ @@
 {
     public function countExistingValues(array $values) : int
     {
-        return count(array_filter($values, function ($position) {
-            return !is_null($position);
-        }));
+        return count($values);
     }
     /**
      * @param Row $row

18) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/FindCellsTiedByTipsInSquare.php:33    [M] Continue_

--- Original
+++ New
@@ @@
             }
             foreach ($square->cellsAsSingleArray() as $otherCell) {
                 if ($otherCell->position() === $position) {
-                    continue;
+                    break;
                 }
                 if ($otherCell->value() !== null) {
                     continue;

20) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/Strategy/Strategy/Substrategy/IsDigitValidInCell.php:31    [M] FalseValue

--- Original
+++ New
@@ @@
             return false;
         }
         if ($cell->isTied() and !array_search($digit, $cell->ties())) {
-            return false;
+            return true;
         }
         if ($cell->row()->findDigit($digit) !== null) {
             return false;

21) /home/josej/phpstorm/sudoku-breaker/src/Domain/Sudoku/ValueObject/Result.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->cells[$row][$column] ?? null;
     }
-    public function steps() : array
+    protected function steps() : array
     {
         return $this->events;
     }

22) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:106    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->error(sprintf('Incorrect format: %s', $exception->getMessage()));
             return -6;
         } catch (Exception $exception) {
-            $this->logger->error('Unexpected error');
+            
             $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
             $this->logger->debug($exception->getMessage());
             $this->logger->debug($exception->getTraceAsString());

23) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:107    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return -6;
         } catch (Exception $exception) {
             $this->logger->error('Unexpected error');
-            $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
+            
             $this->logger->debug($exception->getMessage());
             $this->logger->debug($exception->getTraceAsString());
             return -7;

24) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:116    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } catch (Exception $exception) {
             $this->logger->error('Unexpected error');
             $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
-            $this->logger->debug($exception->getMessage());
+            
             $this->logger->debug($exception->getTraceAsString());
             return -7;
         }

25) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:117    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->logger->error('Unexpected error');
             $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
             $this->logger->debug($exception->getMessage());
-            $this->logger->debug($exception->getTraceAsString());
+            
             return -7;
         }
         return 0;
     }
 }

26) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:118    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
             $this->logger->debug($exception->getMessage());
             $this->logger->debug($exception->getTraceAsString());
-            return -7;
+            return -6;
         }
         return 0;
     }
 }

27) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:118    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
             $this->logger->debug($exception->getMessage());
             $this->logger->debug($exception->getTraceAsString());
-            return -7;
+            return -8;
         }
         return 0;
     }
 }

28) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Command/SolveSudoku.php:118    [M] IntegerNegation

--- Original
+++ New
@@ @@
             $this->logger->debug(sprintf('class: %s - message: %s - file: %s - line: %s', get_class($exception), $exception->getMessage(), $exception->getFile(), $exception->getLine()));
             $this->logger->debug($exception->getMessage());
             $this->logger->debug($exception->getTraceAsString());
-            return -7;
+            return 7;
         }
         return 0;
     }
 }

29) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/ConsoleLoggerFactory.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Symfony\Component\Console\Output\OutputInterface;
 class ConsoleLoggerFactory
 {
-    public function getLogger(OutputInterface $output) : LoggerInterface
+    protected function getLogger(OutputInterface $output) : LoggerInterface
     {
         return new ConsoleLogger($output);
     }
 }

30) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuFileReader.php:37    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @param string $fileName
      * @return false|string
      */
-    protected function readFile(string $fileName)
+    private function readFile(string $fileName)
     {
         return file_get_contents($fileName);
     }

31) /home/josej/phpstorm/sudoku-breaker/src/Infrastructure/Helper/SudokuFileReader.php:39    [M] FunctionCall

--- Original
+++ New
@@ @@
      */
     protected function readFile(string $fileName)
     {
-        return file_get_contents($fileName);
+        file_get_contents($fileName);
+        return null;
     }
     /**
      * @param array $jsonData
